# taps
tap 'homebrew/bundle'
tap 'homebrew/cask-versions'

# brew formulae
brew 'mackup'
brew 'mas'
brew 'wget'
brew 'grep'
brew 'openssh'
brew 'neofetch'
brew 'tree'
brew 'curl'
brew 'openssl'
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'binutils'
brew 'dockutil'
brew 'nmap'
brew 'telnet'
brew 'dnstracer'
brew 'ipcalc'
brew 'mtr'
brew 'speedtest-cli'
brew 'ipinfo-cli'
brew 'koekeishiya/formulae/skhd'

# NetOps
brew 'ansible'
cask 'docker'
cask 'cyberduck'
cask 'postman'
cask 'github'

# dev
brew 'git'
brew 'gh'
brew 'ruby'
#brew 'python'
brew 'tmux'

# macOS apps
cask 'google-chrome'
cask 'discord'
cask 'handbrake'
cask 'yacreader'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
cask 'wireshark'
cask 'angry-ip-scanner'
cask 'the-unarchiver'
cask 'caffeine'
cask 'synergy-core'
cask 'karabiner-elements'
cask 'visual-studio-code'
cask 'microsoft-office'

mas 'Hiddenbar', id: 1452453066
mas 'BetterSnapTool', id: 417375580
